package jp.co.xypenguin.game.algo;

/**********************************************************
 *	カードを表すクラス
 *
 *********************************************************/
class Card{
	private boolean bothSides;	//カードの裏表
	private String kind;	//マーク
	private int number;		//数字
	/******************************************************
	 *	コンストラクタ
	 *	カードのマークと種類を初期化
	 *****************************************************/
	Card(String kind, int number){
		this.kind = kind;
		this.number = number;
	}
	/******************************************************
	 *	メソッド（オーバーライド）
	 *	カードの書式
	 *****************************************************/
	public String toString(){
		return kind + "：" + number;
	}
	/******************************************************
	 *	
	 *	カードの数字を返す
	 *****************************************************/
	int getNumber(){
		return number;
	}
	/******************************************************
	 *	
	 *	カードのマークを返す
	 *****************************************************/
	String getKind(){
		return kind;
	}
	/******************************************************
	 *	
	 *	カードの裏か表かを返す
	 *****************************************************/
	boolean getBothSides(){
		return bothSides;
	}
	/******************************************************
	 *	
	 *	カードの裏か表かを決める
	 *****************************************************/
	void setBothSides(boolean bothSides){
		this.bothSides = bothSides;
	}
}
